shivanshBTW/esp32-pc-controller/sdkconfig.defaults
# Board: ESP32-S3-WROOM-1-N16R8 (16MB flash, 8MB Octal PSRAM)
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n

CONFIG_FREERTOS_HZ=1000

CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# OTA dual-slot partition table (layout kept so OTA from older images still works)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# mDNS
CONFIG_MDNS_MAX_SERVICES=10

# Bluetooth is not used
CONFIG_BT_ENABLED=n
